package p0918;

public class A_TodayLecture {

//@인터페이스

//-기본-
//1. 모두 추상메소드여야함.
//2. 추상클래스보다 추상화 정도가 높다.
//3. 왜 만드냐? 다형성의 구조를 쓰기위해 만듬
//4. 추상메서드(abstract)와 상수(final붙음)만을 멤버로 가질 수 있음.
//5. 정해진 규칙에 맞게 구현해야함.
//6. class 대신 interface 사용
//7.상속이 가능 (다중상속이 가능)
//8. Object클래스와 같은 최고 조상이 없음.
//9. extends 대신 'implements' 사용
	
//-인터페이스를 이용한 다형성-
//1. 인터페이스 타입의 변수로 클래스이 인스턴스 참조가능.
//2. **인터페이스를 메서드의 매개변수 타입으로 지정가능. 
//3. **인터페이스를 메서드의 리턴타입으로 매개변수로 사용가능.

// 대부분 내용없는 인터페이스를 만들어, 상속관계를 생성하는데 많이 이용!
// 두 객체 간의 '중간 역할'(연결, 소통)
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
